MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_uart.h
/* UART_TXDATA Bits */
/* UART_TXDATA[DATA] Bits */
#define UART_TXDATA_DATA_OFS                     (0)                             /* !< DATA Offset */
#define UART_TXDATA_DATA_MASK                    ((uint32_t)0x000000FFU)         /* !< Data Transmitted or Received  Data
                                                                                    that is to be transmitted via the
                                                                                    UART is written to this field.  When
                                                                                    read, this field contains the data
                                                                                    that was received by the UART. */
#define UART_TXDATA_DATA_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_TXDATA_DATA_MAXIMUM                 ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* UART_RXDATA Bits */
/* UART_RXDATA[DATA] Bits */
#define UART_RXDATA_DATA_OFS                     (0)                             /* !< DATA Offset */
#define UART_RXDATA_DATA_MASK                    ((uint32_t)0x000000FFU)         /* !< Received Data.  When read, this
                                                                                    field contains the data that was
                                                                                    received by the UART. */
#define UART_RXDATA_DATA_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_RXDATA_DATA_MAXIMUM                 ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* UART_RXDATA[FRMERR] Bits */
#define UART_RXDATA_FRMERR_OFS                   (8)                             /* !< FRMERR Offset */
#define UART_RXDATA_FRMERR_MASK                  ((uint32_t)0x00000100U)         /* !< UART Framing Error  Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the FRMERR
                                                                                    bit in the UART EVENT ICLR register.
                                                                                    This error is associated with the
                                                                                    character at the top of the FIFO. */
#define UART_RXDATA_FRMERR_CLR                   ((uint32_t)0x00000000U)         /* !< No framing error has occurred */
#define UART_RXDATA_FRMERR_SET                   ((uint32_t)0x00000100U)         /* !< The received character does not
                                                                                    have a valid stop bit sequence, which
                                                                                    is one or two stop bits depending on
                                                                                    the UARTLCRH.STP2 setting (a valid
                                                                                    stop bit is 1). */
/* UART_RXDATA[PARERR] Bits */
#define UART_RXDATA_PARERR_OFS                   (9)                             /* !< PARERR Offset */
#define UART_RXDATA_PARERR_MASK                  ((uint32_t)0x00000200U)         /* !< UART Parity Error   Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the PARERR
                                                                                    bit in the UART EVENT ICLR register. */
#define UART_RXDATA_PARERR_CLR                   ((uint32_t)0x00000000U)         /* !< No parity error has occurred */
#define UART_RXDATA_PARERR_SET                   ((uint32_t)0x00000200U)         /* !< The parity of the received data
                                                                                    character does not match the parity
                                                                                    defined by bits 2 and 7 of the
                                                                                    UARTLCRH register. */
/* UART_RXDATA[BRKERR] Bits */
#define UART_RXDATA_BRKERR_OFS                   (10)                            /* !< BRKERR Offset */
#define UART_RXDATA_BRKERR_MASK                  ((uint32_t)0x00000400U)         /* !< UART Break Error  Writing to this
                                                                                    bit has no effect. The flag is
                                                                                    cleared by writing 1 to the BRKERR
                                                                                    bit in the UART EVENT ICLR register.
                                                                                    This error is associated with the
                                                                                    character at the top of the FIFO.
                                                                                    When a break occurs, only one 0
                                                                                    character is loaded into the FIFO.
                                                                                    The next character is only enabled
                                                                                    after the receive data input goes to
                                                                                    a 1 (marking state) and the next
                                                                                    valid start bit is received. */
#define UART_RXDATA_BRKERR_CLR                   ((uint32_t)0x00000000U)         /* !< No break condition has occurred */
#define UART_RXDATA_BRKERR_SET                   ((uint32_t)0x00000400U)         /* !< A break condition has been
                                                                                    detected, indicating that the receive
                                                                                    data input was held low for longer
                                                                                    than a full-word transmission time
                                                                                    (defined as start, data, parity, and
                                                                                    stop bits). */
/* UART_RXDATA[OVRERR] Bits */
#define UART_RXDATA_OVRERR_OFS                   (11)                            /* !< OVRERR Offset */
#define UART_RXDATA_OVRERR_MASK                  ((uint32_t)0x00000800U)         /* !< UART Receive Overrun Error  Writing
                                                                                    to this bit has no effect. The flag
                                                                                    is cleared by writing 1 to the OVRERR
                                                                                    bit in the UART EVENT ICLR register.
                                                                                    In case of a receive FIFO overflow,
                                                                                    the FIFO contents remain valid
                                                                                    because no further data is written
                                                                                    when the FIFO is full. Only the
                                                                                    contents of the shift register are
                                                                                    overwritten. The CPU must read the
                                                                                    data in order to empty the FIFO. */
#define UART_RXDATA_OVRERR_CLR                   ((uint32_t)0x00000000U)         /* !< No data has been lost due to a
                                                                                    receive overrun. */
#define UART_RXDATA_OVRERR_SET                   ((uint32_t)0x00000800U)         /* !< New data was received but could not
                                                                                    be stored, because the previous data
                                                                                    was not read (resulting in data
                                                                                    loss). */
/* UART_RXDATA[NERR] Bits */
#define UART_RXDATA_NERR_OFS                     (12)                            /* !< NERR Offset */
#define UART_RXDATA_NERR_MASK                    ((uint32_t)0x00001000U)         /* !< Noise Error. Writing to this bit
                                                                                    has no effect. The flag is cleared by
                                                                                    writing 1 to the NERR bit in the UART
                                                                                    EVENT ICLR register. */
#define UART_RXDATA_NERR_CLR                     ((uint32_t)0x00000000U)         /* !< No noise error occured */
#define UART_RXDATA_NERR_SET                     ((uint32_t)0x00001000U)         /* !< Noise error occured during majority
                                                                                    voting */

/* UART_LINCNT Bits */
/* UART_LINCNT[VALUE] Bits */
#define UART_LINCNT_VALUE_OFS                    (0)                             /* !< VALUE Offset */
#define UART_LINCNT_VALUE_MASK                   ((uint32_t)0x0000FFFFU)         /* !< 16 bit up counter clocked by the
                                                                                    functional clock of the UART. */
#define UART_LINCNT_VALUE_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_LINCNT_VALUE_MAXIMUM                ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* UART_LINCTL Bits */
/* UART_LINCTL[CTRENA] Bits */
#define UART_LINCTL_CTRENA_OFS                   (0)                             /* !< CTRENA Offset */
#define UART_LINCTL_CTRENA_MASK                  ((uint32_t)0x00000001U)         /* !< LIN Counter Enable. LIN counter
                                                                                    will only count when enabled. */
#define UART_LINCTL_CTRENA_DISABLE               ((uint32_t)0x00000000U)         /* !< Counter disabled */
#define UART_LINCTL_CTRENA_ENABLE                ((uint32_t)0x00000001U)         /* !< Counter enabled */
/* UART_LINCTL[ZERONE] Bits */
#define UART_LINCTL_ZERONE_OFS                   (1)                             /* !< ZERONE Offset */
#define UART_LINCTL_ZERONE_MASK                  ((uint32_t)0x00000002U)         /* !< Zero on negative Edge of RXD. When
                                                                                    enabled the counter is set to 0 and
                                                                                    starts counting on a negative edge of
                                                                                    RXD */
#define UART_LINCTL_ZERONE_DISABLE               ((uint32_t)0x00000000U)         /* !< Zero on negative edge disabled */
#define UART_LINCTL_ZERONE_ENABLE                ((uint32_t)0x00000002U)         /* !< Zero on negative edge enabled */
/* UART_LINCTL[CNTRXLOW] Bits */
#define UART_LINCTL_CNTRXLOW_OFS                 (2)                             /* !< CNTRXLOW Offset */
#define UART_LINCTL_CNTRXLOW_MASK                ((uint32_t)0x00000004U)         /* !< Count while low Signal on RXD When
                                                                                    counter is enabled and the signal on
                                                                                    RXD is low, the counter increments. */
#define UART_LINCTL_CNTRXLOW_DISABLE             ((uint32_t)0x00000000U)         /* !< Count while low Signal on UARTxRXD
                                                                                    disabled */
#define UART_LINCTL_CNTRXLOW_ENABLE              ((uint32_t)0x00000004U)         /* !< Count while low Signal on UARTxRXD
                                                                                    enabled */
/* UART_LINCTL[LINC0CAP] Bits */
#define UART_LINCTL_LINC0CAP_OFS                 (4)                             /* !< LINC0CAP Offset */
#define UART_LINCTL_LINC0CAP_MASK                ((uint32_t)0x00000010U)         /* !< Capture Counter on negative RXD
                                                                                    Edge. When enabled the counter value
                                                                                    is captured to LINC0 register on each
                                                                                    negative RXD edge. A LINC0 interrupt
                                                                                    is triggered when enabled. */
#define UART_LINCTL_LINC0CAP_DISABLE             ((uint32_t)0x00000000U)         /* !< Capture counter on negative
                                                                                    UARTxRXD edge disabled */
#define UART_LINCTL_LINC0CAP_ENABLE              ((uint32_t)0x00000010U)         /* !< Capture counter on negative
                                                                                    UARTxRXD edge enabled */
/* UART_LINCTL[LINC1CAP] Bits */
#define UART_LINCTL_LINC1CAP_OFS                 (5)                             /* !< LINC1CAP Offset */
#define UART_LINCTL_LINC1CAP_MASK                ((uint32_t)0x00000020U)         /* !< Capture Counter on positive RXD
                                                                                    Edge. When enabled the counter value
                                                                                    is captured to LINC1 register on each
                                                                                    positive RXD edge. A LINC1 interrupt
                                                                                    is triggered when enabled. */
#define UART_LINCTL_LINC1CAP_DISABLE             ((uint32_t)0x00000000U)         /* !< Capture counter on positive
                                                                                    UARTxRXD edge disabled */
#define UART_LINCTL_LINC1CAP_ENABLE              ((uint32_t)0x00000020U)         /* !< Capture counter on positive
                                                                                    UARTxRXD edge enabled */
/* UART_LINCTL[LINC0_MATCH] Bits */
#define UART_LINCTL_LINC0_MATCH_OFS              (6)                             /* !< LINC0_MATCH Offset */
#define UART_LINCTL_LINC0_MATCH_MASK             ((uint32_t)0x00000040U)         /* !< Counter Compare Match Mode  When
                                                                                    this bit is set to 1 a counter
                                                                                    compare match with LINC0 register
                                                                                    triggers an LINC0 interrupt when
                                                                                    enabled. */
#define UART_LINCTL_LINC0_MATCH_DISABLE          ((uint32_t)0x00000000U)         /* !< Counter compare match mode disabled
                                                                                    (capture mode enabled) */
#define UART_LINCTL_LINC0_MATCH_ENABLE           ((uint32_t)0x00000040U)         /* !< Counter compare match enabled
                                                                                    (capture mode disabled) */

